Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументНаСервере(МесяцНачисления) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор
	               |ПОМЕСТИТЬ СписокДоговоров
	               |ИЗ
	               |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	               |ГДЕ
	               |	ВКМ_ОбслуживаниеКлиента.Дата >= &ДатаНачалаПериода
	               |	И ВКМ_ОбслуживаниеКлиента.Проведен = ИСТИНА
	               |	И ВКМ_ОбслуживаниеКлиента.Дата <= &ДатаОкончанияПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ОбслуживаниеКлиента.Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслуг.Договор КАК Договор
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Дата >= &ДатаНачалаПериода
	               |	И РеализацияТоваровУслуг.Дата <= &ДатаОкончанияПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписокДоговоров.Договор КАК Договор,
	               |	СписокДоговоров.Договор.Владелец КАК ДоговорВладелец,
	               |	СписокДоговоров.Договор.Организация КАК ДоговорОрганизация,
	               |	СписокДоговоров.Договор.Представление КАК ДоговорПредставление,
	               |	ЕСТЬNULL(ВТ_Документы.Ссылка, 0) КАК Документ
	               |ИЗ
	               |	СписокДоговоров КАК СписокДоговоров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	               |		ПО СписокДоговоров.Договор = ВТ_Документы.Договор";
	
	Запрос.УстановитьПараметр("ДатаНачалаПериода", НачалоМесяца(МесяцНачисления) );
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(МесяцНачисления) );
	ВыборкаДоговор = Запрос.Выполнить().Выбрать();
	МассивДоговоров = Новый Массив();
	МассивДокументов = Новый Массив();
	n=0;

	Пока ВыборкаДоговор.Следующий() Цикл
		Реализация = ВыборкаДоговор.Документ;
		Если Реализация = 0 тогда
		ДокРеализацииОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокРеализацииОбъект.Заполнить(ВыборкаДоговор.Договор); 
		ДокРеализацииОбъект.Записать();
		Иначе
		ДокРеализацииСсылка = ВыборкаДоговор.Документ;
		ДокРеализацииОбъект = ДокРеализацииСсылка.ПолучитьОбъект();
		КонецЕсли;
		ДокРеализацииОбъект.ВыполнитьАвтозаполнение();     
		ДокРеализацииОбъект.ПроверитьЗаполнение();
		ДокРеализацииОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ДокРеализацииСсылка = ДокРеализацииОбъект.Ссылка;
		МассивДоговоров.Вставить(n, ВыборкаДоговор.Договор);
		МассивДокументов.Вставить(n, ДокРеализацииСсылка);
		n=n+1;
	КонецЦикла;	
	    ТаблДок = Новый Массив();
	    ТаблДок.Вставить(0, МассивДоговоров);
	    ТаблДок.Вставить(1, МассивДокументов);
		Возврат ТаблДок;	
КонецФункции
#КонецОбласти
